export const EXPERIENCE_LIST = [
  {
    year: '2015',
    month: '7月',
    title: '結束大學生涯',
    description:
      '我畢業於國立台灣大學，主修化學，這時候的我對平面設計、網頁開發等一竅不通，但是充滿興趣',
    items: ['2009-2013 台大 化學 學士', '2013-2015 台大 化學 碩士'],
  },
  {
    year: '2015',
    month: '8月',
    title: '任職於花王 (台灣) 股份有限公司',
    description:
      '我在花王台灣股份有限公司擔任消費品研究員，工作內容主要為家庭衣物用洗劑的研究與開發',
    items: [
      '跨部門以及跨國合作進行商品的開發與改良',
      '參與多場跨國研討會，擔任過主持人以及發表 poster',
      '擔任「高效率簡報製作」內部講師',
      '運用各種技術來設計符合提案訴求的配方',
      '提供數據化的性能評價結果',
      '產出原形並透過試用調查驗證商品提案的可行性',
      '協助商品的規格制定以及實際生產製造流程建立',
    ],
  },
  {
    year: '2020',
    month: '5月',
    title: '自我進修 UI/UX 設計技能',
    description:
      '疫情爆發後開始重新思考自己的生活方式，因緣際會認識到 UI/UX 設計相關工作，重拾成為設計師的夢想並報名了赫綵設計學院的一系列課程，包含平面設計、UI 設計入門、商業網站架設 (HTML/CSS/jQuery/JS)',
    items: '',
  },
  {
    year: '2022',
    month: '6月',
    title: '從花王辭職，專心準備轉職成前端工程師',
    description:
      '在赫綵設計學院的商業網站架設課程中學到了 HTML/CSS/JS 等程式語言，對前端網頁開發產生濃厚興趣，深思後決定轉職成前端工程師，並從花王辭職後專心準備轉職。自我進修期間購買諸多線上課程以及書籍進行實作練習與作品集製作',
    items: '',
  },
  {
    year: '2022',
    month: '10月',
    title: '任職於攜彼創新股份有限公司',
    description:
      "主要工作內容為<a href='https://dingup.cc/cases' target='_blank'>訂管家</a>的前後端開發與網站維護，以及外包專案的前端開發",
    items: [
      '訂管家網站的前後端開發與網站維護 (主要技術為 Vue2, Vuex, Bootstrap, Laravel PHP)',
      'Vue3 + TypeScript 開發後台網站，功能包含表格資料呈現、多步驟購物流程以及動態插入元件',
      'Vue3 + Nuxt3 開發前後台網站，功能包含會員註冊、登入以及圖表資料呈現 (折線圖、長條圖)',
      'React Native + Expo 開發手機 App，功能包含相機掃描 QR Code、地圖功能、Push Notification、第三方登入 (LINE, Google, Apple) 等',
    ],
  },
  {
    year: '2024',
    month: '7月',
    title: '開始新的旅程',
    description: '積極求職中，期待能夠加入更多有趣的專案，並持續學習成長',
    items: '',
  },
]
